import'#g'
let d='.'
,f='sacred-texts-gtheo.txt'
/*260609全选文本复制<https://sacred-texts.com/cla/hesiod/gtheo.htm>
1.该文用空格排版 源码大量`&nbsp;` 估计处理文本比html方便
.与其它源对比 以及AI核实 第4-5行中间空行错 可能还有其它错空行
.全部行首空四格也错*/
let m=a=>a
	.split('this file.\n\n')[1].split('\n\n \n\n------------')[0]
	.replaceAll('\n\n','\n')
	.replaceAll('\n    ','\n')
	// .replaceAll(' \n','\n')
	.replace('Ἡσίοδος\nΘεογονία\n \n \n','Ἡσίοδος - Θεογονία\n\n')//标题
	.replaceAll('\n \n','\n\n')
	.replace('\n    (σημείωση)\n','')//,l292备注 后插内容
	.replace('\n    Αὐτὸς','\nΑὐτὸς')//l924
	.replace('\n    Κίρκη','\nΚίρκη')//l1011
	.replace('\nᾮ  δ᾽','\nᾮ δ᾽')//429
	.replace(/(?<!\n) ? + /g,'--')//l10开头有空格
	.replace('Κρονίωνος·\n\nκαί','Κρονίωνος·\nκαί')//l5错空行
	.replace(' μιγεῖσα--925',' μιγεῖσα')//错,与影印版核对
	.normalize('NFD').normalize('NFC')
	.replaceAll('·','·')
	.replaceAll('῾Ρ','Ῥ')//.replace(/Ρ\u0314/g,'Ῥ')
	.replace(
`μείλιχον ἐξ ἀρχῆς, ἀγανώτατον ἐντὸς Ὀλύμπου,--408
ἤπιον ἀνθρώποισι καὶ ἀθανάτοισι θεοῖσιν.--407`,
`ἤπιον ἀνθρώποισι καὶ ἀθανάτοισι θεοῖσιν.--407
μείλιχον ἐξ ἀρχῆς, ἀγανώτατον ἐντὸς Ὀλύμπου,--408`)
	.replace(
`καὶ γέρας ἐν γαίῃ τε καὶ οὐρανῷ ἠδὲ θαλάσσῃ·--427
οὐδ᾽, ὅτι μουνογενής, ἧσσον θεὰ ἔμμορε τιμῆς,--426`,
`οὐδ᾽, ὅτι μουνογενής, ἧσσον θεὰ ἔμμορε τιμῆς,--426
καὶ γέρας ἐν γαίῃ τε καὶ οὐρανῷ ἠδὲ θαλάσσῃ·--427`)
	.replace(
`ἔν τε δίκῃ βασιλεῦσι παρ᾽ αἰδοίοισι καθίζει,--434
ἔν τ᾽ ἀγορῇ λαοῖσι μεταπρέπει, ὅν κ᾽ ἐθέλῃσιν·--430
ἠδ᾽ ὁπότ᾽ ἐς πόλεμον φθεισήνορα θωρήσσωνται
ἀνέρες, ἔνθα θεὰ παραγίγνεται, οἷς κ᾽ ἐθέλῃσι
νίκην προφρονέως ὀπάσαι καὶ κῦδος ὀρέξαι.--433`,
`ἔν τ᾽ ἀγορῇ λαοῖσι μεταπρέπει, ὅν κ᾽ ἐθέλῃσιν·--430
ἠδ᾽ ὁπότ᾽ ἐς πόλεμον φθεισήνορα θωρήσσωνται
ἀνέρες, ἔνθα θεὰ παραγίγνεται, οἷς κ᾽ ἐθέλῃσι
νίκην προφρονέως ὀπάσαι καὶ κῦδος ὀρέξαι.--433
ἔν τε δίκῃ βασιλεῦσι παρ᾽ αἰδοίοισι καθίζει,--434`)
	.replace(
`ἀντίον ἀλλήλοισι διὰ κρατερὰς ὑσμίνας,--631
Τιτῆνές τε θεοὶ καὶ ὅσοι Κρόνου ἐξεγένοντο·--630`,
`Τιτῆνές τε θεοὶ καὶ ὅσοι Κρόνου ἐξεγένοντο·--630
ἀντίον ἀλλήλοισι διὰ κρατερὰς ὑσμίνας,--631`)
,check=a=>a.split('\n').filter(a=>a!='')
	.filter((a,i)=>i%5==4).filter(a=>!a.includes('--'))
	.forEach(p)
,work=a=>(a=m(a),check(a.slice(20)),a)
,toTranslator=a=>a.replaceAll('\n\n','\n')
	.replaceAll('--','\n---').replaceAll('\n','\n\n')
/*260610全选文本复制<http://users.uoa.gr/~nektar/history/tributes/ancient_authors/Hesiodus/Theogonia.htm>
*/
,uoa=a=>a
	.replace('Ἡσίοδος - Θεογονία\n\t','Ἡσίοδος - Θεογονία\n\n')
	.replace(' (*)','')
	.split('\nΒάσει τῶν:')[0]
	.replace('\n\nἐ καί','καί')
	.replaceAll('\t\n\n','\t')//如l66 p导致行号多空行
	.split('\n')//.filter(a=>!a.endsWith('\t'))
	.map((a=>a.split('\t').reverse().join('--').trimEnd()))
	// .map((a,_,__,[i,t]=a.split('\t'))=>t+'--'+i)
	.join('\n')
	.replace(
`Γείνατο δ᾽ Ἀστερίην ἐυώνυμον, ἥν ποτε Πέρσης
μείλιχον ἐξ ἀρχῆς, ἀγανώτατον ἐντὸς Ὀλύμπου,--408`,
`μείλιχον ἐξ ἀρχῆς, ἀγανώτατον ἐντὸς Ὀλύμπου,--408
Γείνατο δ᾽ Ἀστερίην ἐυώνυμον, ἥν ποτε Πέρσης`)
	.replace('\nἀ\n','\n')//l439
	.replace(
'ντίον ἀλλήλοισι διὰ κρατερὰς ὑσμίνας, 631',
'ἀντίον ἀλλήλοισι διὰ κρατερὰς ὑσμίνας,--631')
import{readFile as rd,writeFile as wt}from'fs/promises'
import{join as jn,extname as xn}from'path'
const 
mod=async(f,t,m)=>{
	let a=await rd(f,'utf8')
	a=await m(a)
	await wt(t,a)
}
await mod(jn(d,f),'希腊语.txt',work)
await mod('希腊语.txt','toTranslator.txt',toTranslator)
await mod('uoa-gr-nektar.txt','t.txt',uoa)
eq('Μουσάων'.normalize('NFD').normalize('NFC'),'Μουσάων')